tap "craftamap/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "versent/taps"
tap "warrensbox/tap"
tap "weaveworks/tap"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "asdf"
brew "python@3.12"
brew "autojump"
brew "cryptography"
brew "awscli"
brew "binutils"
brew "node"
brew "bitwarden-cli"
brew "black"
brew "freetype"
brew "chezmoi"
brew "chroma"
brew "cmake"
brew "diffutils"
brew "direnv"
brew "eslint"
brew "findutils"
brew "flake8"
brew "fzf"
brew "gh"
brew "git-extras"
brew "unbound"
brew "gnupg"
brew "go"
brew "goenv"
brew "golangci-lint"
brew "grep"
brew "hadolint"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "kube-score"
brew "kubernetes-cli"
brew "kubectx"
brew "lsd"
brew "make"
brew "mysql"
brew "nmap"
brew "openjdk"
brew "openvpn"
brew "pinentry-mac"
brew "poetry"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "stylelint"
brew "telnet"
brew "tflint"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "trash", link: true
brew "tre-command"
brew "vim"
brew "watch"
brew "wget"
brew "yadm"
brew "zsh"
brew "zsh-completions"
brew "craftamap/tap/bb"
brew "weaveworks/tap/eksctl"
cask "aws-vpn-client"
cask "bitwarden"
cask "drawio"
cask "git-credential-manager"
cask "google-cloud-sdk"
cask "google-drive"
cask "grammarly-desktop"
cask "keepassxc"
cask "onedrive"
cask "postman"
cask "session-manager-plugin"
cask "tableplus"
