tap "charmbracelet/tap"
tap "craftamap/tap"
tap "hashicorp/tap"
tap "warrensbox/tap"
tap "weaveworks/tap"
brew "asdf"
brew "autoconf"
brew "python@3.12"
brew "autojump"
brew "automake"
brew "cryptography"
brew "awscli"
brew "bat"
brew "binutils"
brew "node"
brew "bitwarden-cli"
brew "black"
brew "freetype"
brew "chezmoi"
brew "chroma"
brew "cmake"
brew "codespell"
brew "colima"
brew "coreutils"
brew "diffutils"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "duti"
brew "eslint"
brew "expect"
brew "eza"
brew "unbound"
brew "ffmpeg"
brew "findutils"
brew "flake8"
brew "fzf"
brew "gh"
brew "git-extras"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "goenv"
brew "golangci-lint"
brew "grep"
brew "hadolint"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "kube-score"
brew "kubernetes-cli"
brew "kubectx"
brew "languagetool"
brew "libtool"
brew "lsd"
brew "make"
brew "mysql"
brew "nmap"
brew "openjdk"
brew "openvpn"
brew "parallel"
brew "pinentry-mac"
brew "poetry"
brew "pre-commit"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "stern"
brew "stylelint"
brew "tealdeer"
brew "telnet"
brew "tflint"
brew "thefuck"
brew "tmux"
brew "trash", link: true
brew "tre-command"
brew "vale"
brew "vim"
brew "watch"
brew "wget"
brew "whisper-cpp"
brew "yadm"
brew "yamllint"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "charmbracelet/tap/gum"
brew "craftamap/tap/bb"
cask "aws-vpn-client"
cask "bitwarden"
cask "blackhole-2ch"
cask "blurred"
cask "chatgpt"
cask "displaylink"
cask "drawio"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite"
cask "hiddenbar"
cask "keepassxc"
cask "logi-options+"
cask "maccy"
cask "microsoft-edge"
cask "notion"
cask "onedrive"
cask "postman"
cask "session-manager-plugin"
cask "shottr"
cask "slack"
cask "sourcetree"
cask "stats"
cask "tableplus"
cask "vlc"
cask "warp"
cask "windows-app"
cask "xbar"
