# =============================================================================
# Foundry Development Environment - Cross-Platform Brewfile
# Supports: macOS, Linux, WSL
# =============================================================================

# -----------------------------------------------------------------------------
# Custom Taps
# -----------------------------------------------------------------------------
tap "charmbracelet/tap"
tap "craftamap/tap"
tap "hashicorp/tap"
tap "thecasualcoder/stable"
tap "warrensbox/tap"

# -----------------------------------------------------------------------------
# Core Development Tools (macOS + Linux)
# -----------------------------------------------------------------------------
brew "asdf"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bat"
brew "bc"
brew "binutils"
brew "bitwarden-cli"
brew "black"
brew "bottom"
brew "brew-gem"
brew "cfn-lint"
brew "chroma"
brew "cmake"
brew "codespell"
brew "colima"
brew "coreutils"
brew "cryptography"
brew "diffutils"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "doggo"
brew "dyff"
brew "eksctl"
brew "expect"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "flake8"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-extras"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "goenv"
brew "golangci-lint"
brew "grep"
brew "hadolint"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "k9s"
brew "kube-score"
brew "kubernetes-cli"
brew "kubectx"
brew "languagetool"
brew "libtool"
brew "lsd"
brew "make"
brew "mysql"
brew "ncdu"
brew "nmap"
brew "node"
brew "ollama"
brew "openjdk"
brew "openvpn"
brew "openssl@3"
brew "ouch"
brew "parallel"
brew "percona-toolkit"
brew "pipx"
brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "python@3.12"
brew "q"
brew "qemu"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "stern"
brew "stylelint"
brew "tealdeer"
brew "telnet"
brew "terraform-docs"
brew "tf-summarize"
brew "tflint"
brew "thefuck"
brew "tmux"
brew "tokei"
brew "tre-command"
brew "unbound"
brew "uv"
brew "vale"
brew "vim"
brew "watch"
brew "wget"
brew "whisper-cpp"
brew "xh"
brew "xz"
brew "yadm"
brew "yamllint"
brew "yq"
brew "zellij"
brew "zlib"
brew "zsh"
brew "zsh-completions"

# Custom tap formulae
brew "charmbracelet/tap/gum"
brew "craftamap/tap/bb"
brew "hashicorp/tap/terraform"

# -----------------------------------------------------------------------------
# macOS-Specific Packages
# -----------------------------------------------------------------------------
if OS.mac?
  brew "autojump"
  brew "duti"
  brew "freetype"
  brew "lima-additional-guestagents"
  brew "pinentry-mac"
  brew "reattach-to-user-namespace"
  brew "trash", link: true
end

# -----------------------------------------------------------------------------
# macOS-Only Casks (GUI Applications)
# -----------------------------------------------------------------------------
if OS.mac?
  cask "aws-vpn-client"
  cask "background-music"
  cask "bitwarden"
  cask "blackhole-2ch"
  cask "blurred"
  cask "chatgpt"
  cask "chatgpt-atlas"
  cask "claude"
  cask "displaylink"
  cask "drawio"
  cask "font-hack-nerd-font"
  cask "font-jetbrains-mono-nerd-font"
  cask "gcloud-cli"
  cask "git-credential-manager"
  cask "google-chrome"
  cask "google-drive"
  cask "gpg-suite"
  cask "hiddenbar"
  cask "keepassxc"
  cask "logi-options+"
  cask "maccy"
  cask "microsoft-edge"
  cask "notion"
  cask "onedrive"
  cask "postman"
  cask "session-manager-plugin"
  cask "shottr"
  cask "slack"
  cask "sourcetree"
  cask "stats"
  cask "tableplus"
  cask "tor-browser"
  cask "vlc"
  cask "warp"
  cask "windows-app"
  cask "xbar"
end

# -----------------------------------------------------------------------------
# Linux-Specific Packages (if needed in future)
# -----------------------------------------------------------------------------
# if OS.linux?
#   brew "linux-specific-tool"
# end

# -----------------------------------------------------------------------------
# Go Development Tools (macOS + Linux)
# -----------------------------------------------------------------------------
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
